config/Documents/РезультатыПроверкиМагазинаРДСокращенные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>РезультатыПроверкиМагазинаРДСокращенные</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НацДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСоответствия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииПроверкиМагазиновРД_Сокращенные</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>350</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарииПроверяющего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаУправляющему</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИсполнителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаОбИсполнении</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Documents/РезультатыПроверкиМагазинаРДСокращенные/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.Подразделение.ТолькоПросмотр = Ложь;
		Элементы.Город.ТолькоПросмотр = Ложь;
		Элементы.Управляющий.ТолькоПросмотр = Ложь;
		Элементы.НацДиректор.ТолькоПросмотр = Ложь;
		Элементы.РегионДиректор.ТолькоПросмотр = Ложь;
		Элементы.Результаты.ТолькоПросмотр = Ложь;
		Элементы.Автор.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Автор.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	ТекущийОбъект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
//	
//	//если нужно - создаем задачи
//	Для Каждого стр из ТекущийОбъект.Результаты цикл
//		Если ЗначениеЗаполнено(стр.КомментарииПроверяющего) тогда
//			// проверка пользователя для сотрудника = управляющего
//			Запрос = Новый Запрос;
//			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//			               |	Пользователи.Ссылка КАК Пользователь
//			               |ИЗ
//			               |	Справочник.Пользователи КАК Пользователи
//			               |ГДЕ
//			               |	Пользователи.СоотвСотрудник = &СоотвСотрудник";
//						   
//			Запрос.УстановитьПараметр("СоотвСотрудник", ТекущийОбъект.Управляющий);
//			
//			ПользУправляющий = Справочники.Пользователи.ПустаяСсылка();
//			выб = Запрос.Выполнить().Выбрать();
//			Если выб.Следующий() тогда
//				ПользУправляющий = выб.Пользователь;
//			КонецЕсли;
//			
//			Если ПользУправляющий = Справочники.Пользователи.ПустаяСсылка() тогда
//				Сообщить("Для сотрудника " + ТекущийОбъект.Управляющий + " не задано соответствие в пользователях." + 
//				Символы.ПС + "Невозможно установить задачу!");
//				Продолжить;
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(стр.ЗадачаУправляющему) тогда
//				ТекЗадача = стр.ЗадачаУправляющему.ПолучитьОбъект();
//			иначе
//				ТекЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
//			КонецЕсли;
//			
//			ТекЗадача.Автор = ТекущийОбъект.Автор;
//			ТекЗадача.Дата = ТекущийОбъект.Дата;//ТекущаяДатаСеанса();
//			ТекЗадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
//			ТекЗадача.Исполнитель = ПользУправляющий;//ТекущийОбъект.Управляющий;
//			//ТекЗадача.Предмет = ЗадачаСсылка;
//			ТекЗадача.СрокИсполнения = стр.СрокУстранения;
//			
//			ТекЗадача.Описание = стр.КомментарииПроверяющего;
//			ТекЗадача.Наименование = "Выполнить указания согласно проверки №" + ТекущийОбъект.Номер + " от " + ТекущийОбъект.Дата;
//			
//			ТекЗадача.Записать();
//			 			
//			
//			стр.ЗадачаУправляющему = ТекЗадача.Ссылка;

//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры
